IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_erad_crc_global_regs.xml
<module id="ERAD_CRC_GLOBAL_REGS" HW_revision="" description="ERAD CRC GLOBAL Registers">
	<register id="CRC_GLOBAL_CTRL" width="16" page="1" offset="0x0" internal="0" description="CRC_GLOBAL_CRTL">
		<bitfield id="CRC1_INIT" description="Initialize CRC Module 1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CRC2_INIT" description="Initialize CRC Module 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRC3_INIT" description="Initialize CRC Module 3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CRC4_INIT" description="Initialize CRC Module 4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CRC5_INIT" description="Initialize CRC Module 5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CRC6_INIT" description="Initialize CRC Module 6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CRC7_INIT" description="Initialize CRC Module 7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CRC8_INIT" description="Initialize CRC Module 8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CRC1_EN" description="Enable CRC Module 1" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CRC2_EN" description="Enable CRC Module 2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CRC3_EN" description="Enable CRC Module 3" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CRC4_EN" description="Enable CRC Module 4" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CRC5_EN" description="Enable CRC Module 5" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CRC6_EN" description="Enable CRC Module 6" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CRC7_EN" description="Enable CRC Module 7" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CRC8_EN" description="Enable CRC Module 8" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
